# Core formatting & linting
dbaeumer.vscode-eslint
esbenp.prettier-vscode

# Git
eamodio.gitlens

# Theme & icons
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
charliermarsh.ruff

# YAML
redhat.vscode-yaml

# Shell
foxundermoon.shell-format
